In [1]:
import pandas as pd

In [2]:
grades = pd.Series(range(80,100,2))
print(grades)

0    80
1    82
2    84
3    86
4    88
5    90
6    92
7    94
8    96
9    98
dtype: int64

In [3]:
print(grades.describe())
print(len(grades))

count    10.000000
mean     89.000000
std       6.055301
min      80.000000
25%      84.500000
50%      89.000000
75%      93.500000
max      98.000000
dtype: float64
10

In [4]:
height = pd.Series([175,184,170], index=['Kim','kwon','lee'])
print(height)
print(height.kwon, height['kwon'], height[1])

Kim     175
kwon    184
lee     170
dtype: int64
184 184 184

In [5]:
nation = pd.Series({'korea':82, 'Japan':81,'China':'cn'})
print(nation)

korea    82
Japan    81
China    cn
dtype: object

In [6]:
scores = {'kim':[12,23,54],'Park':[32,43,12],'Sam':[21,54,75],'Wokn':[100,32,54],'lee':[32,45,12]}
scores_df = pd.DataFrame(scores)
print(scores_df)

   kim  Park  Sam  Wokn  lee
0   12    32   21   100   32
1   23    43   54    32   45
2   54    12   75    54   12

In [7]:
# Changing index 
scores_ni = pd.DataFrame(scores, index = ['Math','Econ','Physics'])
print(scores_ni)
scores_df.index = ['Math','Econ','Physics']
print(scores_df)

         kim  Park  Sam  Wokn  lee
Math      12    32   21   100   32
Econ      23    43   54    32   45
Physics   54    12   75    54   12
         kim  Park  Sam  Wokn  lee
Math      12    32   21   100   32
Econ      23    43   54    32   45
Physics   54    12   75    54   12

In [8]:
print(scores_df)
print(scores_df.at['Econ','Wokn'], scores_df.iat[1,3])

         kim  Park  Sam  Wokn  lee
Math      12    32   21   100   32
Econ      23    43   54    32   45
Physics   54    12   75    54   12
32 32

In [11]:
scores_df[scores_df >= 20]

          kim  Park  Sam  Wokn   lee
Math      NaN  32.0   21   100  32.0
Econ     23.0  43.0   54    32  45.0
Physics  54.0   NaN   75    54   NaN

In [12]:
scores_df[scores_df >= 20 & (scores_df > 80)]

         kim  Park  Sam  Wokn  lee
Math      12    32   21   100   32
Econ      23    43   54    32   45
Physics   54    12   75    54   12

In [13]:
pd.set_option('precision', 3)
print(scores_df.describe())

          kim    Park     Sam     Wokn     lee
count   3.000   3.000   3.000    3.000   3.000
mean   29.667  29.000  50.000   62.000  29.667
std    21.779  15.716  27.221   34.699  16.623
min    12.000  12.000  21.000   32.000  12.000
25%    17.500  22.000  37.500   43.000  22.000
50%    23.000  32.000  54.000   54.000  32.000
75%    38.500  37.500  64.500   77.000  38.500
max    54.000  43.000  75.000  100.000  45.000

In [14]:
scores_df.mean()

kim     29.667
Park    29.000
Sam     50.000
Wokn    62.000
lee     29.667
dtype: float64

In [15]:
scores_df.T

      Math  Econ  Physics
kim     12    23       54
Park    32    43       12
Sam     21    54       75
Wokn   100    32       54
lee     32    45       12

In [16]:
scores_df.T.describe()

          Math    Econ  Physics
count    5.000   5.000    5.000
mean    39.400  39.400   41.400
std     34.897  12.054   28.174
min     12.000  23.000   12.000
25%     21.000  32.000   12.000
50%     32.000  43.000   54.000
75%     32.000  45.000   54.000
max    100.000  54.000   75.000

In [17]:
scores_df.sort_values(by = 'Econ', axis = 1, ascending = False)

         Sam  lee  Park  Wokn  kim
Math      21   32    32   100   12
Econ      54   45    43    32   23
Physics   75   12    12    54   54

In [18]:
scores_df.T.sort_values(by = 'Econ', ascending = False)

      Math  Econ  Physics
Sam     21    54       75
lee     32    45       12
Park    32    43       12
Wokn   100    32       54
kim     12    23       54

In [20]:
auto_firms = ['Hundai', 'Honda', 'Kia', 'Audi','Hundai', 'Honda', 'Kia', 'Audi','Hundai', 'Honda', 'Kia', 'Audi','Hundai', 'Honda', 'Kia']
Year = list(range(1990,2005,1)); Rank = list(range(15))
auto_df = pd.DataFrame({'Year':Year, 'Rank':Rank, 'Marker':auto_firms})
print(auto_df)

    Year  Rank  Marker
0   1990     0  Hundai
1   1991     1   Honda
2   1992     2     Kia
3   1993     3    Audi
4   1994     4  Hundai
5   1995     5   Honda
6   1996     6     Kia
7   1997     7    Audi
8   1998     8  Hundai
9   1999     9   Honda
10  2000    10     Kia
11  2001    11    Audi
12  2002    12  Hundai
13  2003    13   Honda
14  2004    14     Kia

In [22]:
am_onehot = pd.get_dummies(auto_df['Marker'])
print(am_onehot)

    Audi  Honda  Hundai  Kia
0      0      0       1    0
1      0      1       0    0
2      0      0       0    1
3      1      0       0    0
4      0      0       1    0
5      0      1       0    0
6      0      0       0    1
7      1      0       0    0
8      0      0       1    0
9      0      1       0    0
10     0      0       0    1
11     1      0       0    0
12     0      0       1    0
13     0      1       0    0
14     0      0       0    1